milestone4/celtix-distribution/src/main/samples/hello_world_dispatch/src/demo/hwDispatch/client/GreetMeDocLiteralReq3.xml

<?xml version="1.0" encoding="utf-8" ?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Body><ns4:greetMe xmlns:ns4="http://objectweb.org/hello_world_soap_http/types"><ns4:requestType>Heron</ns4:requestType></ns4:greetMe></SOAP-ENV:Body></SOAP-ENV:Envelope>
